<a href="https://colab.research.google.com/github/pd047/Pandas-Basics/blob/main/Retrieving_and_knowing_the_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

## Import the dataset from url

In [ ]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'

df = pd.read_csv(url, '\t')

In [ ]:
df.head(10)

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98
5         3  ...     $10.98
6         3  ...      $1.69
7         4  ...     $11.75
8         4  ...      $9.25
9         5  ...      $9.25

[10 rows x 5 columns]

##  What is the number of observations in the dataset?

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [ ]:
df.shape

(4622, 5)

In [ ]:
df.quantity.value_counts()

1     4355
2      224
3       28
4       10
15       1
7        1
10       1
5        1
8        1
Name: quantity, dtype: int64

## Columns

In [ ]:
df.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

# How is the dataset indexed?

In [ ]:
df.index

RangeIndex(start=0, stop=4622, step=1)

#  Most-ordered item

In [ ]:
(df.groupby(['item_name']).agg({'quantity':"sum"})).sort_values('quantity',ascending=False)[:10]

                              quantity
item_name
Chicken Bowl                       761
Chicken Burrito                    591
Chips and Guacamole                506
Steak Burrito                      386
Canned Soft Drink                  351
Chips                              230
Steak Bowl                         221
Bottled Water                      211
Chips and Fresh Tomato Salsa       130
Canned Soda                        126

In [ ]:
(df.groupby(['choice_description']).agg({'quantity':"sum"})).sort_values('quantity',ascending=False)[:10]

                                                    quantity
choice_description
[Diet Coke]                                              159
[Coke]                                                   143
[Sprite]                                                  89
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese...        49
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese...        42
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese...        40
[Lemonade]                                                36
[Fresh Tomato Salsa (Mild), [Pinto Beans, Rice,...        36
[Coca Cola]                                               32
[Fresh Tomato Salsa, [Rice, Cheese, Sour Cream,...        30

# How many items were orderd in total?

In [ ]:
df.quantity.sum()

4972

# Turn the item price into a float

In [ ]:
df['price'] = df.item_price.str.slice(1)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
 5   price               4622 non-null   object
dtypes: int64(2), object(4)
memory usage: 216.8+ KB

In [ ]:
df = df.astype({'price':float})

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
 5   price               4622 non-null   float64
dtypes: float64(1), int64(2), object(3)
memory usage: 216.8+ KB

In [ ]:
df = df.drop(['item_price'],axis=1)
df.head()

   order_id  quantity  ...                                 choice_description  price
0         1         1  ...                                                NaN   2.39
1         1         1  ...                                       [Clementine]   3.39
2         1         1  ...                                            [Apple]   3.39
3         1         1  ...                                                NaN   2.39
4         2         2  ...  [Tomatillo-Red Chili Salsa (Hot), [Black Beans...  16.98

[5 rows x 5 columns]

# How much was the revenue for the period in the dataset?

In [ ]:
revenue = (df['quantity']*df['price']).sum()
revenue

39237.02

# Orders made in the period

In [ ]:
No_of_orders = df.order_id.nunique()
No_of_orders

1834

# What is the average revenue amount per order?

In [ ]:
Avg_rev = revenue/No_of_orders

Avg_rev

21.39423118865867

# How many different items are sold?

In [ ]:
df.item_name.nunique()    ### nunique() function return number of unique elements in the object.

50